# Brewfile for setting up Mac environment
# To install everything listed below, run:

# Command: brew bundle --file=~/dotfiles/homebrew/.Brewfile

# Set applications to install in /Applications
cask_args appdir: "/Applications"

# Homebrew formulae (command-line tools)
brew "git"
brew "tree"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "stow"
brew "gitleaks"
brew "mas"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "eza"
brew "zoxide"
brew "bat"
brew "tldr"


# Homebrew casks (GUI apps)
cask "ghostty"
cask "brave-browser"
cask "raycast"
cask "visual-studio-code"
cask "pearcleaner"
cask "whatsapp"
cask "font-jetbrains-mono-nerd-font"
